## Final Project Submission

Please fill out:
* Student name: Shane Mangold
* Student pace: full time
* Scheduled project review date/time: 06/25/2021 5:00pm est
* Instructor name: David Elliott
* Blog post URL:

## Importing the Data

In [1]:
import pandas as pd
import matplotlib.pyplot as plt
import pandas as pd
import gzip
from io import StringIO
%matplotlib inline

In [2]:
# This function uses try statements to push through errors and unzip the csv data
def unzip_csv(file_location): 
    file = gzip.open(file_location, 'rb')
    content = file.read()
    file.close()
    try:
        content_str = str(content,'utf-8')
        content_data = StringIO(content_str) 
    except:
        content_str = str(content,'latin-1')
        content_data = StringIO(content_str) 
    try:
        return pd.read_csv(content_data)
    except:
        return pd.read_csv(content_data, sep='\t')

In [3]:
#for copy paste purposes
!ls -la zippedData/

total 45724
drwxr-xr-x 1 smang 197609        0 Jun 19 22:04 .
drwxr-xr-x 1 smang 197609        0 Jun 20 11:55 ..
-rw-r--r-- 1 smang 197609    53544 Jun 19 22:04 bom.movie_gross.csv.gz
-rw-r--r-- 1 smang 197609 18070960 Jun 19 22:04 imdb.name.basics.csv.gz
-rw-r--r-- 1 smang 197609  5599979 Jun 19 22:04 imdb.title.akas.csv.gz
-rw-r--r-- 1 smang 197609  3459897 Jun 19 22:04 imdb.title.basics.csv.gz
-rw-r--r-- 1 smang 197609  1898523 Jun 19 22:04 imdb.title.crew.csv.gz
-rw-r--r-- 1 smang 197609 12287583 Jun 19 22:04 imdb.title.principals.csv.gz
-rw-r--r-- 1 smang 197609   539530 Jun 19 22:04 imdb.title.ratings.csv.gz
-rw-r--r-- 1 smang 197609   498202 Jun 19 22:04 rt.movie_info.tsv.gz
-rw-r--r-- 1 smang 197609  3402194 Jun 19 22:04 rt.reviews.tsv.gz
-rw-r--r-- 1 smang 197609   827840 Jun 19 22:04 tmdb.movies.csv.gz
-rw-r--r-- 1 smang 197609   153218 Jun 19 22:04 tn.movie_budgets.csv.gz

In [4]:
#hard-coding the file-locations and nicknames into a dict for future reference
#Console commands like !ls -la zippedData give a great place to copy pase this

file_locations = [
    'zippedData/bom.movie_gross.csv.gz'
    ,'zippedData/imdb.name.basics.csv.gz'
    ,'zippedData/imdb.title.akas.csv.gz'
    ,'zippedData/imdb.title.basics.csv.gz'
    ,'zippedData/imdb.title.crew.csv.gz'
    ,'zippedData/imdb.title.principals.csv.gz'
    ,'zippedData/imdb.title.ratings.csv.gz'
    ,'zippedData/rt.movie_info.tsv.gz'
    ,'zippedData/rt.reviews.tsv.gz'
    ,'zippedData/tmdb.movies.csv.gz'
    ,'zippedData/tn.movie_budgets.csv.gz'
]

file_nicknames = ['gross','name','akas','basics','crew','principals','ratings','info','reviews','movies','budget']


#this dicitonary comprehension uses a zip function to smush the two lists together and then parse them into a dict
#we also have a reference for each raw df and its location on the drive.

file_dict = {k:v for k,v in zip(file_nicknames,file_locations)}

In [5]:
#Importing all the data, commented out data we didn't use

#gross = unzip_csv(file_dict['gross'])
name = unzip_csv(file_dict['name'])
#akas = unzip_csv(file_dict['akas'])
basics = unzip_csv(file_dict['basics'])
#crew = unzip_csv(file_dict['crew'])
#principals = unzip_csv(file_dict['principals'])
#ratings = unzip_csv(file_dict['ratings'])
#info = unzip_csv(file_dict['info'])
#reviews = unzip_csv(file_dict['reviews'])
#movies = unzip_csv(file_dict['movies'])
budgets = unzip_csv(file_dict['budget'])

## Cleaning the Data

In [6]:
budgets.head()

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross
0,1,"Dec 18, 2009",Avatar,"$425,000,000","$760,507,625","$2,776,345,279"
1,2,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,"$410,600,000","$241,063,875","$1,045,663,875"
2,3,"Jun 7, 2019",Dark Phoenix,"$350,000,000","$42,762,350","$149,762,350"
3,4,"May 1, 2015",Avengers: Age of Ultron,"$330,600,000","$459,005,868","$1,403,013,963"
4,5,"Dec 15, 2017",Star Wars Ep. VIII: The Last Jedi,"$317,000,000","$620,181,382","$1,316,721,747"

In [7]:
budgets.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5782 entries, 0 to 5781
Data columns (total 6 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   id                 5782 non-null   int64
 1   release_date       5782 non-null   object
 2   movie              5782 non-null   object
 3   production_budget  5782 non-null   object
 4   domestic_gross     5782 non-null   object
 5   worldwide_gross    5782 non-null   object
dtypes: int64(1), object(5)
memory usage: 271.2+ KB

In [8]:
#id column is a redundant index so we're dropping it

budgets.drop('id', axis=1, inplace=True)

In [9]:
#setting date column to datatime object for use in charts etc.

budgets['release_date'] = pd.to_datetime(budgets['release_date'])

In [10]:
#stripping any unseen or unknown whitespace from the object locales

budgets.columns.str.strip()
budgets['movie'] = budgets['movie'].str.strip()

In [11]:
#this function launders the money ;D

def clean_money(budgets_series):
    #the map function applys the .replace to each cell in the given series, x[1:] skips the $
    
    return budgets_series.map(lambda x: int(x[1:].replace(',','')))

In [12]:
budgets['production_budget'] = clean_money(budgets['production_budget'])
budgets['domestic_gross'] = clean_money(budgets['domestic_gross'])
budgets['worldwide_gross'] = clean_money(budgets['worldwide_gross']);

In [13]:
#looks good

budgets.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5782 entries, 0 to 5781
Data columns (total 5 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   release_date       5782 non-null   datetime64[ns]
 1   movie              5782 non-null   object
 2   production_budget  5782 non-null   int64
 3   domestic_gross     5782 non-null   int64
 4   worldwide_gross    5782 non-null   int64
dtypes: datetime64[ns](1), int64(3), object(1)
memory usage: 226.0+ KB

In [14]:
basics.head()

,tconst,primary_title,original_title,start_year,runtime_minutes,genres
0,tt0063540,Sunghursh,Sunghursh,2013,175.0,"Action,Crime,Drama"
1,tt0066787,One Day Before the Rainy Season,Ashad Ka Ek Din,2019,114.0,"Biography,Drama"
2,tt0069049,The Other Side of the Wind,The Other Side of the Wind,2018,122.0,Drama
3,tt0069204,Sabse Bada Sukh,Sabse Bada Sukh,2018,NaN,"Comedy,Drama"
4,tt0100275,The Wandering Soap Opera,La Telenovela Errante,2017,80.0,"Comedy,Drama,Fantasy"

In [15]:
basics.columns

Index(['tconst', 'primary_title', 'original_title', 'start_year',
       'runtime_minutes', 'genres'],
      dtype='object')

In [16]:
basics['movie'] = basics['primary_title']

In [17]:
#we only wanted genres titles, and ttconst for matching to the other file

basics.drop(['primary_title','original_title','start_year'
                ,'runtime_minutes'],axis=1,inplace=True)

In [18]:
basics.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 146144 entries, 0 to 146143
Data columns (total 3 columns):
 #   Column  Non-Null Count   Dtype
---  ------  --------------   -----
 0   tconst  146144 non-null  object
 1   genres  140736 non-null  object
 2   movie   146144 non-null  object
dtypes: object(3)
memory usage: 3.3+ MB

In [19]:
#the strip functions remove unwanted whitespace if its lurking in there

basics.columns = basics.columns.str.strip()

for column in list(basics.columns):
    basics[column] = basics[column].str.strip()

In [20]:
#the dataframe below proivdes a list of indices that contain a null value in the genre column
#the genre column is very important to our analysis so we'll drop null values

to_drop = basics[basics['genres'].isna()==True].index


#simple drop function will finish the job

basics.drop(to_drop,inplace=True)

In [21]:
#this .map will apply a .split to all the genres at each "," creating lists within the df

basics['genres'] = basics['genres'].map(lambda x: x.split(","))

In [22]:
basics['genres'][0]

['Action', 'Crime', 'Drama']

In [23]:
basics['genres'][0][1]

'Crime'

In [24]:
name.head()

,nconst,primary_name,birth_year,death_year,primary_profession,known_for_titles
0,nm0061671,Mary Ellen Bauder,NaN,NaN,"miscellaneous,production_manager,producer","tt0837562,tt2398241,tt0844471,tt0118553"
1,nm0061865,Joseph Bauer,NaN,NaN,"composer,music_department,sound_department","tt0896534,tt6791238,tt0287072,tt1682940"
2,nm0062070,Bruce Baum,NaN,NaN,"miscellaneous,actor,writer","tt1470654,tt0363631,tt0104030,tt0102898"
3,nm0062195,Axel Baumann,NaN,NaN,"camera_department,cinematographer,art_department","tt0114371,tt2004304,tt1618448,tt1224387"
4,nm0062798,Pete Baxter,NaN,NaN,"production_designer,art_department,set_decorator","tt0452644,tt0452692,tt3458030,tt2178256"

In [25]:
#dropping these since they're outside the scope of our analysis

name.drop(['nconst','birth_year','death_year',],axis=1,inplace=True)

In [26]:
name.isnull().sum()

primary_name              0
primary_profession    51340
known_for_titles      30204
dtype: int64

In [27]:
#this phrase finds null values in either column

to_drop = name[(name['primary_profession'].isna()==True)|
               name['known_for_titles'].isna()==True].index

In [28]:
name.drop(to_drop,inplace=True)

In [29]:
#splitting the nested data

name['known_for_titles'] = name['known_for_titles'].map(lambda x: x.split(","))
name['primary_profession'] = name['primary_profession'].map(lambda x: x.split(","));

In [30]:
name['known_for_titles'][0][0]

'tt0837562'

For nested data remember that you can use df.explode() to create a data frame with each known value for a given column with duplicate values in the other columns. This will be usefull when looking at genres and primary professions

In [31]:
name = name.explode('primary_profession', ignore_index=True)

In [32]:
name.head()

,primary_name,primary_profession,known_for_titles
0,Mary Ellen Bauder,miscellaneous,"[tt0837562, tt2398241, tt0844471, tt0118553]"
1,Mary Ellen Bauder,production_manager,"[tt0837562, tt2398241, tt0844471, tt0118553]"
2,Mary Ellen Bauder,producer,"[tt0837562, tt2398241, tt0844471, tt0118553]"
3,Joseph Bauer,composer,"[tt0896534, tt6791238, tt0287072, tt1682940]"
4,Joseph Bauer,music_department,"[tt0896534, tt6791238, tt0287072, tt1682940]"

In [33]:
#so here we take a df of all the data with primary professions of producer or director and then ignore the rest. We have 
#duplicate values in the rest of the columns so as long as each movie has a producer or a director, we will have it.

to_keep = name[name.primary_profession =='producer']
name = to_keep
name.head()

,primary_name,primary_profession,known_for_titles
2,Mary Ellen Bauder,producer,"[tt0837562, tt2398241, tt0844471, tt0118553]"
27,Bryan Beasley,producer,"[tt3501180, tt1485100, tt1358897, tt1387162]"
29,Martine Beauchemin,producer,"[tt5479010, tt0316463, tt1286159, tt0380732]"
32,Michael Frost Beckner,producer,"[tt0108171, tt0095953, tt0266987, tt0285332]"
46,Hans Beimler,producer,"[tt0486657, tt0092455, tt0091129, tt0106145]"

In [34]:
#now we go ahead and explode by known titles so we can continue to narrow in on what we're looking for out of this frame

name = name.explode('known_for_titles',ignore_index=True)

In [35]:
name.head()

        primary_name primary_profession known_for_titles
0  Mary Ellen Bauder           producer        tt0837562
1  Mary Ellen Bauder           producer        tt2398241
2  Mary Ellen Bauder           producer        tt0844471
3  Mary Ellen Bauder           producer        tt0118553
4      Bryan Beasley           producer        tt3501180

In [39]:
#I couldnt handle the complexity of the multiple jobs in the proffession column to I only took producers...
#I can drop one of these columns and rename the name column to refelct that these are producers only

name['producer_name'] = name['primary_name']
name.drop(['primary_profession','primary_name'],axis=1, inplace=True)

In [40]:
name.head()

  known_for_titles      producer_name
0        tt0837562  Mary Ellen Bauder
1        tt2398241  Mary Ellen Bauder
2        tt0844471  Mary Ellen Bauder
3        tt0118553  Mary Ellen Bauder
4        tt3501180      Bryan Beasley

In [126]:
num_repeats = name.known_for_titles.value_counts()

In [131]:
#looks like we have repeat values for the tconst numbers so...

#Theres a lot going on here but I am needing to isolate the values of each infividual count of tconst
#using a list comp then dict comp because its such a memory intensive task... for loops with a .append() 
#takes a brick of time.

title_counts = {k:v for k,v in zip(
    num_repeats.index
    , [x for x in num_repeats
      if x > 1]
    )
}
title_counts

{'tt0486531': 221,
 'tt0452046': 167,
 'tt0795174': 158,
 'tt0133302': 135,
 'tt0203259': 133,
 'tt0413573': 125,
 'tt0364845': 120,
 'tt0206501': 111,
 'tt1586680': 100,
 'tt0058796': 89,
 'tt0094416': 87,
 'tt0460681': 86,
 'tt0069658': 80,
 'tt2741602': 77,
 'tt1856010': 76,
 'tt0056758': 75,
 'tt1844624': 74,
 'tt0944947': 72,
 'tt0364151': 71,
 'tt1378167': 70,
 'tt1408430': 66,
 'tt1345836': 66,
 'tt0098844': 66,
 'tt1595859': 65,
 'tt2364582': 64,
 'tt0804503': 63,
 'tt0065272': 62,
 'tt0247082': 62,
 'tt6111130': 61,
 'tt0844441': 60,
 'tt0475784': 59,
 'tt0460627': 59,
 'tt1219024': 59,
 'tt1759761': 58,
 'tt0806910': 58,
 'tt3749900': 57,
 'tt0418279': 57,
 'tt1600194': 57,
 'tt1520211': 56,
 'tt2805096': 56,
 'tt2372162': 55,
 'tt0460649': 53,
 'tt1796960': 53,
 'tt0092325': 52,
 'tt0411008': 51,
 'tt0285331': 50,
 'tt1442437': 50,
 'tt0108757': 50,
 'tt0094481': 50,
 'tt1825683': 49,
 'tt2249007': 49,
 'tt0159876': 49,
 'tt0072562': 49,
 'tt2402207': 49,
 'tt2281375': 48,
 'tt0371746': 48,
 'tt1567432': 48,
 'tt0088580': 47,
 'tt0146386': 46,
 'tt2193021': 46,
 'tt4154756': 46,
 'tt2788432': 45,
 'tt3566726': 45,
 'tt1837576': 45,
 'tt0455275': 45,
 'tt0141842': 45,
 'tt0088512': 45,
 'tt2975590': 45,
 'tt0848228': 44,
 'tt2109248': 44,
 'tt4490348': 44,
 'tt0386676': 44,
 'tt2015381': 44,
 'tt0979432': 43,
 'tt1405406': 43,
 'tt0395843': 43,
 'tt0083452': 42,
 'tt1489428': 42,
 'tt2249786': 42,
 'tt1124373': 42,
 'tt1043090': 41,
 'tt0831387': 41,
 'tt0796366': 41,
 'tt1375666': 41,
 'tt2782710': 41,
 'tt0773262': 41,
 'tt1830617': 41,
 'tt0903747': 41,
 'tt1064899': 41,
 'tt5555260': 40,
 'tt1839578': 40,
 'tt2356777': 40,
 'tt0092322': 39,
 'tt3107288': 39,
 'tt0112022': 39,
 'tt0106179': 38,
 'tt3743822': 38,
 'tt0441074': 38,
 'tt3498820': 38,
 'tt3502248': 38,
 'tt3205802': 38,
 'tt1392170': 38,
 'tt0472954': 38,
 'tt2575290': 37,
 'tt0412142': 37,
 'tt0115147': 37,
 'tt1826940': 37,
 'tt3560084': 37,
 'tt3532216': 37,
 'tt0367279': 37,
 'tt2261391': 37,
 'tt0319262': 37,
 'tt2137109': 37,
 'tt1266020': 37,
 'tt0313043': 37,
 'tt0478970': 36,
 'tt3032476': 36,
 'tt1740299': 36,
 'tt2250912': 36,
 'tt0062595': 36,
 'tt0810788': 35,
 'tt2262532': 35,
 'tt0092455': 35,
 'tt0468569': 35,
 'tt2820852': 35,
 'tt1477834': 35,
 'tt3322312': 35,
 'tt0480249': 35,
 'tt1270798': 35,
 'tt1270797': 35,
 'tt0496424': 35,
 'tt1398426': 35,
 'tt3371366': 35,
 'tt1119644': 35,
 'tt0993846': 35,
 'tt5164196': 34,
 'tt4052886': 34,
 'tt2357547': 34,
 'tt3843168': 34,
 'tt0316654': 34,
 'tt0239195': 34,
 'tt4154796': 34,
 'tt1046173': 34,
 'tt2149175': 33,
 'tt3514324': 33,
 'tt3281796': 33,
 'tt2234701': 33,
 'tt0306414': 33,
 'tt0387199': 33,
 'tt0425637': 33,
 'tt0264235': 33,
 'tt1840309': 33,
 'tt0458339': 33,
 'tt0145487': 33,
 'tt3148266': 33,
 'tt0948470': 33,
 'tt4016454': 33,
 'tt3322314': 33,
 'tt0758745': 32,
 'tt0369610': 32,
 'tt1843866': 32,
 'tt0234215': 32,
 'tt0285335': 32,
 'tt0407887': 32,
 'tt0318224': 32,
 'tt0120201': 32,
 'tt0266697': 32,
 'tt0120591': 32,
 'tt1327801': 32,
 'tt0436992': 32,
 'tt3014866': 32,
 'tt0816711': 32,
 'tt2431438': 31,
 'tt0368479': 31,
 'tt1583421': 31,
 'tt0409459': 31,
 'tt0770828': 31,
 'tt1285016': 31,
 'tt2527336': 31,
 'tt3748528': 31,
 'tt2575988': 30,
 'tt1291150': 30,
 'tt6483832': 30,
 'tt4270492': 30,
 'tt0372784': 30,
 'tt3315342': 30,
 'tt1431045': 30,
 'tt0407304': 30,
 'tt1855199': 30,
 'tt4998350': 30,
 'tt1663202': 30,
 'tt3502262': 30,
 'tt1211956': 30,
 'tt2005374': 30,
 'tt1399045': 30,
 'tt1024648': 30,
 'tt4474344': 30,
 'tt0800369': 30,
 'tt0116629': 30,
 'tt0324924': 29,
 'tt2231461': 29,
 'tt1074638': 29,
 'tt0279600': 29,
 'tt0944835': 29,
 'tt1981128': 29,
 'tt1386697': 29,
 'tt0462322': 29,
 'tt1439629': 29,
 'tt1706620': 29,
 'tt1663662': 29,
 'tt0120685': 29,
 'tt0120737': 29,
 'tt1219289': 29,
 'tt0489099': 29,
 'tt2105044': 29,
 'tt0499549': 29,
 'tt4630562': 29,
 'tt0317919': 29,
 'tt2103188': 29,
 'tt2211129': 28,
 'tt1845307': 28,
 'tt2467372': 28,
 'tt0120338': 28,
 'tt0389557': 28,
 'tt0439100': 28,
 'tt1578873': 28,
 'tt0765429': 28,
 'tt1440129': 28,
 'tt1298650': 28,
 'tt1959563': 28,
 'tt5114356': 28,
 'tt0285333': 28,
 'tt0381061': 28,
 'tt2908446': 28,
 'tt1399103': 28,
 'tt5296406': 28,
 'tt0990407': 28,
 'tt1934673': 28,
 'tt2488496': 27,
 'tt0181689': 27,
 'tt2002718': 27,
 'tt1327773': 27,
 'tt5511582': 27,
 'tt0493464': 27,
 'tt0149261': 27,
 'tt3501074': 27,
 'tt0813715': 27,
 'tt3487356': 27,
 'tt1276104': 27,
 'tt1951266': 27,
 'tt4574334': 27,
 'tt0437741': 27,
 'tt0376994': 27,
 'tt2119532': 27,
 'tt1408101': 27,
 'tt1259528': 27,
 'tt1190080': 27,
 'tt0159206': 27,
 'tt5827228': 27,
 'tt0167260': 27,
 'tt0108709': 27,
 'tt1371111': 27,
 'tt0337978': 27,
 'tt1877832': 27,
 'tt3501584': 26,
 'tt2058107': 26,
 'tt1219827': 26,
 'tt1674771': 26,
 'tt0430357': 26,
 'tt3663490': 26,
 'tt1836037': 26,
 'tt1800241': 26,
 'tt1320253': 26,
 'tt4158110': 26,
 'tt0227972': 26,
 'tt1409024': 26,
 'tt5024912': 26,
 'tt3464902': 26,
 'tt2402101': 26,
 'tt2058673': 26,
 'tt0356910': 26,
 'tt2582782': 26,
 'tt0423652': 26,
 'tt0048845': 26,
 'tt3501632': 26,
 'tt4532368': 26,
 'tt1392190': 26,
 'tt6343314': 26,
 'tt2578508': 26,
 'tt0337692': 26,
 'tt3262006': 26,
 'tt0198190': 26,
 'tt6473344': 26,
 'tt2234222': 26,
 'tt4209256': 26,
 'tt0098904': 26,
 'tt2209764': 25,
 'tt2267998': 25,
 'tt0472043': 25,
 'tt0118276': 25,
 'tt0185906': 25,
 'tt1229238': 25,
 'tt3783958': 25,
 'tt1104001': 25,
 'tt1650062': 25,
 'tt3896198': 25,
 'tt1300854': 25,
 'tt0396392': 25,
 'tt1598778': 25,
 'tt2802850': 25,
 'tt2699128': 25,
 'tt0408306': 25,
 'tt0369179': 25,
 'tt0118480': 25,
 'tt1853728': 25,
 'tt2528814': 25,
 'tt1442462': 25,
 'tt2891574': 25,
 'tt3076658': 25,
 'tt0120667': 25,
 'tt0368008': 25,
 'tt0490215': 25,
 'tt4419214': 25,
 'tt0454876': 25,
 'tt0478304': 25,
 'tt0241383': 25,
 'tt0861689': 25,
 'tt7235466': 25,
 'tt1817273': 25,
 'tt2126355': 25,
 'tt0176357': 25,
 'tt1905041': 24,
 'tt0437086': 24,
 'tt0108778': 24,
 'tt0379889': 24,
 'tt0320037': 24,
 'tt2345759': 24,
 'tt0053494': 24,
 'tt0103396': 24,
 'tt0343818': 24,
 'tt5362988': 24,
 'tt4981826': 24,
 'tt0472198': 24,
 'tt0800080': 24,
 'tt1798709': 24,
 'tt1250777': 24,
 'tt5834204': 24,
 'tt1596346': 24,
 'tt1979320': 24,
 'tt0986263': 24,
 'tt1196946': 24,
 'tt0185103': 24,
 'tt2649554': 24,
 'tt1895587': 24,
 'tt1615147': 24,
 'tt0427327': 24,
 'tt2562232': 24,
 'tt1385826': 24,
 'tt0120903': 24,
 'tt5052448': 24,
 'tt0285403': 24,
 'tt0200276': 24,
 'tt0297174': 24,
 'tt1441326': 24,
 'tt1951264': 24,
 'tt0290334': 24,
 'tt0098749': 24,
 'tt1253864': 24,
 'tt1020072': 24,
 'tt0325980': 24,
 'tt2660888': 24,
 'tt1655461': 24,
 'tt0458525': 24,
 'tt1790809': 24,
 'tt0830515': 24,
 'tt1596343': 23,
 'tt0405336': 23,
 'tt2101441': 23,
 'tt0375679': 23,
 'tt1951265': 23,
 'tt1731141': 23,
 'tt0438488': 23,
 'tt2262227': 23,
 'tt1450321': 23,
 'tt1103987': 23,
 'tt0882977': 23,
 'tt1059786': 23,
 'tt4263482': 23,
 'tt0410975': 23,
 'tt5640558': 23,
 'tt1670345': 23,
 'tt2402157': 23,
 'tt3721936': 23,
 'tt3949660': 23,
 'tt1704573': 23,
 'tt4094300': 23,
 'tt1333125': 23,
 'tt4452630': 23,
 'tt1707386': 23,
 'tt1272878': 23,
 'tt1191111': 23,
 'tt0449059': 23,
 'tt2395427': 23,
 'tt1324999': 23,
 'tt6133466': 23,
 'tt0120815': 23,
 'tt2306299': 23,
 'tt0964517': 23,
 'tt0896872': 23,
 'tt0348150': 23,
 'tt1133985': 23,
 'tt2179136': 23,
 'tt0790736': 23,
 'tt0842926': 23,
 'tt3228904': 23,
 'tt0106079': 23,
 'tt0454848': 23,
 'tt5688932': 23,
 'tt1626146': 23,
 'tt0898367': 22,
 'tt0898266': 22,
 'tt0277371': 22,
 'tt1408253': 22,
 'tt5463162': 22,
 'tt2283362': 22,
 'tt0123338': 22,
 'tt1535108': 22,
 'tt4050462': 22,
 'tt0359950': 22,
 'tt1688612': 22,
 'tt1846589': 22,
 'tt1210819': 22,
 'tt2707408': 22,
 'tt4047038': 22,
 'tt1193138': 22,
 'tt1091909': 22,
 'tt1299368': 22,
 'tt0286486': 22,
 'tt0401729': 22,
 'tt2230619': 22,
 'tt5095030': 22,
 'tt4288182': 22,
 'tt5071412': 22,
 'tt0120647': 22,
 'tt1464540': 22,
 'tt0448011': 22,
 'tt0257076': 22,
 'tt1655442': 22,
 'tt0299658': 22,
 'tt0096697': 22,
 'tt0859163': 22,
 'tt1872181': 22,
 'tt0416449': 22,
 'tt1291584': 22,
 'tt4572514': 22,
 'tt0120611': 22,
 'tt1060277': 22,
 'tt3337194': 22,
 'tt6045840': 22,
 'tt2103281': 22,
 'tt0298814': 22,
 'tt0485947': 22,
 'tt2241351': 22,
 'tt5016504': 22,
 'tt4669986': 22,
 'tt1125849': 22,
 'tt3731562': 22,
 'tt0954947': 22,
 'tt3774114': 22,
 'tt1111422': 22,
 'tt1340138': 22,
 'tt2699110': 21,
 'tt0277296': 21,
 'tt2017109': 21,
 'tt1093357': 21,
 'tt0985694': 21,
 'tt0340855': 21,
 'tt1628841': 21,
 'tt3596174': 21,
 'tt1204975': 21,
 'tt1245526': 21,
 'tt2379713': 21,
 'tt1075417': 21,
 'tt2085059': 21,
 'tt0458481': 21,
 'tt1091191': 21,
 'tt2304933': 21,
 'tt1464580': 21,
 'tt1478338': 21,
 'tt0368530': 21,
 'tt0068069': 21,
 'tt0096542': 21,
 'tt1211837': 21,
 'tt1469304': 21,
 'tt1365050': 21,
 'tt1055369': 21,
 'tt1637574': 21,
 'tt4364202': 21,
 'tt0790636': 21,
 'tt3316948': 21,
 'tt1495708': 21,
 'tt3827540': 21,
 'tt1862079': 21,
 'tt0110912': 21,
 'tt0822847': 21,
 'tt1228705': 21,
 'tt3072482': 21,
 'tt4635276': 21,
 'tt1336608': 21,
 'tt0238784': 21,
 'tt4824302': 21,
 'tt3829266': 21,
 'tt4833364': 21,
 'tt3460252': 21,
 'tt0114369': 21,
 'tt1551632': 21,
 'tt0437745': 21,
 'tt1302006': 21,
 'tt1343092': 21,
 'tt0382992': 21,
 'tt0790712': 21,
 'tt7349662': 21,
 'tt0113277': 21,
 'tt3528906': 21,
 'tt1981558': 21,
 'tt0426459': 21,
 'tt0213149': 21,
 'tt1527186': 21,
 'tt0977855': 21,
 'tt4560436': 21,
 'tt4643084': 21,
 'tt2543328': 21,
 'tt1242460': 21,
 'tt1621045': 21,
 'tt3551096': 21,
 'tt4154664': 21,
 'tt1022603': 21,
 'tt0246578': 21,
 'tt0124932': 21,
 'tt0947798': 21,
 'tt0974015': 21,
 'tt0431197': 20,
 'tt5420376': 20,
 'tt4779682': 20,
 'tt3006802': 20,
 'tt1037705': 20,
 'tt2120120': 20,
 'tt0171804': 20,
 'tt0960144': 20,
 'tt1155076': 20,
 'tt0387564': 20,
 'tt2147225': 20,
 'tt0102685': 20,
 'tt4093826': 20,
 'tt0206634': 20,
 'tt1041677': 20,
 'tt0838247': 20,
 'tt2910274': 20,
 'tt1045658': 20,
 'tt0129387': 20,
 'tt1631867': 20,
 'tt1791528': 20,
 'tt0118375': 20,
 'tt1355631': 20,
 'tt3327536': 20,
 'tt2402927': 20,
 'tt1490017': 20,
 'tt0116695': 20,
 'tt0114558': 20,
 'tt1587310': 20,
 'tt3488298': 20,
 'tt2400463': 20,
 'tt5348176': 20,
 'tt0139654': 20,
 'tt1663676': 20,
 'tt0367027': 20,
 'tt0449088': 20,
 'tt0133093': 20,
 'tt0450314': 20,
 'tt0133152': 20,
 'tt1619029': 20,
 'tt1020109': 20,
 'tt1935896': 20,
 'tt6265828': 20,
 'tt2158640': 20,
 'tt0407362': 20,
 'tt2024544': 20,
 'tt1856101': 20,
 'tt3553976': 20,
 'tt1632701': 20,
 'tt0780504': 20,
 'tt4425200': 20,
 'tt4846340': 20,
 'tt0104797': 20,
 'tt5206770': 20,
 'tt1500910': 20,
 'tt1483013': 20,
 'tt1124035': 20,
 'tt1959490': 20,
 'tt0275140': 20,
 'tt1100089': 20,
 'tt5519340': 20,
 'tt1099212': 20,
 'tt3859618': 20,
 'tt0119094': 20,
 'tt2302755': 20,
 'tt1843230': 20,
 'tt2334649': 19,
 'tt0296572': 19,
 'tt0443272': 19,
 'tt5171438': 19,
 'tt1502712': 19,
 'tt1677720': 19,
 'tt1972591': 19,
 'tt1013752': 19,
 'tt7959026': 19,
 'tt1394280': 19,
 'tt2637276': 19,
 'tt2071758': 19,
 'tt0451279': 19,
 'tt0241527': 19,
 'tt3152624': 19,
 'tt3044834': 19,
 'tt0485985': 19,
 'tt1764651': 19,
 'tt1980003': 19,
 'tt0158552': 19,
 'tt6998518': 19,
 'tt4952142': 19,
 'tt1034415': 19,
 'tt1023114': 19,
 'tt0997152': 19,
 'tt1492179': 19,
 'tt2294449': 19,
 'tt0181865': 19,
 'tt8804580': 19,
 'tt0106697': 19,
 'tt0822854': 19,
 'tt3063516': 19,
 'tt1001508': 19,
 'tt0385726': 19,
 'tt0887912': 19,
 'tt1188729': 19,
 'tt1617661': 19,
 'tt2872718': 19,
 'tt1119646': 19,
 'tt3659388': 19,
 'tt0816462': 19,
 'tt1645080': 19,
 'tt1673434': 19,
 'tt1386703': 19,
 'tt0346491': 19,
 'tt1318514': 19,
 'tt1292566': 19,
 'tt4015500': 19,
 'tt0430308': 19,
 'tt1127715': 19,
 'tt0109830': 19,
 'tt2543164': 19,
 'tt2350496': 19,
 'tt0258068': 19,
 'tt1194173': 19,
 'tt7125860': 19,
 'tt0468489': 19,
 'tt0370263': 19,
 'tt0114857': 19,
 'tt2101341': 19,
 'tt2984576': 19,
 'tt1637688': 19,
 'tt1837492': 19,
 'tt1454029': 19,
 'tt0181852': 19,
 'tt1586752': 19,
 'tt2848292': 19,
 'tt0808096': 19,
 'tt4428122': 19,
 'tt1855325': 19,
 'tt1201607': 19,
 'tt2088003': 19,
 'tt5592146': 18,
 'tt3172532': 18,
 'tt0325710': 18,
 'tt2322441': 18,
 'tt0121766': 18,
 'tt1798684': 18,
 'tt3312830': 18,
 'tt0192917': 18,
 'tt0455944': 18,
 'tt0878804': 18,
 'tt1189340': 18,
 'tt2179116': 18,
 'tt1430132': 18,
 'tt0245712': 18,
 'tt2879552': 18,
 'tt0115285': 18,
 'tt2647544': 18,
 'tt2932536': 18,
 'tt0463985': 18,
 'tt2170584': 18,
 'tt6966692': 18,
 'tt1321870': 18,
 'tt0450259': 18,
 'tt1790885': 18,
 'tt0343660': 18,
 'tt2006295': 18,
 'tt0118749': 18,
 'tt0126029': 18,
 'tt0467406': 18,
 'tt0106145': 18,
 'tt1517451': 18,
 'tt0396269': 18,
 'tt1620935': 18,
 'tt0166924': 18,
 'tt1658837': 18,
 'tt0248654': 18,
 'tt0884732': 18,
 'tt2461150': 18,
 'tt1502407': 18,
 'tt0399295': 18,
 'tt5027774': 18,
 'tt1172570': 18,
 'tt1860357': 18,
 'tt0421715': 18,
 'tt1800302': 18,
 'tt0892255': 18,
 'tt2578560': 18,
 'tt4577466': 18,
 'tt2661044': 18,
 'tt0942385': 18,
 'tt1723121': 18,
 'tt0390699': 18,
 'tt0362270': 18,
 'tt0808151': 18,
 'tt2193041': 18,
 'tt0382491': 18,
 'tt0167261': 18,
 'tt0401792': 18,
 'tt1853739': 18,
 'tt2679042': 18,
 'tt2883512': 18,
 'tt1758692': 18,
 'tt0787524': 18,
 'tt0478134': 18,
 'tt1413492': 18,
 'tt1462900': 18,
 'tt4522400': 18,
 'tt1486834': 18,
 'tt0295178': 18,
 'tt0772137': 18,
 'tt0758746': 18,
 'tt0375063': 18,
 'tt0405159': 18,
 'tt1608290': 18,
 'tt2404463': 18,
 'tt1532503': 18,
 'tt2123146': 18,
 'tt0457430': 18,
 'tt5574490': 18,
 'tt2076566': 18,
 'tt0172495': 18,
 'tt0457400': 18,
 'tt0280707': 18,
 'tt4975856': 18,
 'tt2017038': 18,
 'tt1282140': 18,
 'tt3450958': 18,
 'tt5034326': 18,
 'tt1711425': 18,
 'tt0117998': 17,
 'tt0374900': 17,
 'tt0196229': 17,
 'tt0389722': 17,
 'tt0418819': 17,
 'tt2345481': 17,
 'tt1298649': 17,
 'tt1185836': 17,
 'tt0327850': 17,
 'tt4698684': 17,
 'tt0433387': 17,
 'tt0163651': 17,
 'tt1439572': 17,
 'tt0955308': 17,
 'tt4034228': 17,
 'tt5651844': 17,
 'tt0450232': 17,
 'tt3967856': 17,
 'tt0305357': 17,
 'tt4236770': 17,
 'tt1242422': 17,
 'tt3091166': 17,
 'tt2261227': 17,
 'tt0388795': 17,
 'tt0805669': 17,
 'tt0204946': 17,
 'tt3079380': 17,
 'tt0244365': 17,
 'tt1220634': 17,
 'tt3890160': 17,
 'tt6053438': 17,
 'tt0443489': 17,
 'tt1606375': 17,
 'tt2884206': 17,
 'tt3628704': 17,
 'tt0120679': 17,
 'tt0383574': 17,
 'tt0453467': 17,
 'tt0891100': 17,
 'tt3381008': 17,
 'tt0395251': 17,
 'tt0318627': 17,
 'tt1568346': 17,
 'tt0929632': 17,
 'tt3564858': 17,
 'tt0413300': 17,
 'tt0840361': 17,
 'tt1972571': 17,
 'tt0816692': 17,
 'tt8416494': 17,
 'tt0408790': 17,
 'tt0460829': 17,
 'tt2396589': 17,
 'tt0445934': 17,
 'tt2025690': 17,
 'tt1175709': 17,
 'tt0435651': 17,
 'tt0395584': 17,
 'tt5460226': 17,
 'tt0277434': 17,
 'tt1405365': 17,
 'tt0140352': 17,
 'tt1225901': 17,
 'tt0186566': 17,
 'tt0044265': 17,
 'tt2729716': 17,
 'tt0162677': 17,
 'tt0289879': 17,
 'tt0302886': 17,
 'tt1136608': 17,
 'tt3499096': 17,
 'tt0232500': 17,
 'tt0409904': 17,
 'tt3922818': 17,
 'tt0096555': 17,
 'tt0335345': 17,
 'tt1517260': 17,
 'tt1723816': 17,
 'tt1458175': 17,
 'tt1748122': 17,
 'tt1615065': 17,
 'tt1399683': 17,
 'tt0162346': 17,
 'tt1637727': 17,
 'tt1433108': 17,
 'tt2382396': 17,
 'tt0094415': 17,
 'tt6294822': 17,
 'tt1418377': 17,
 'tt0199257': 17,
 'tt3039472': 17,
 'tt0120812': 17,
 'tt0162065': 17,
 'tt0374455': 17,
 'tt1179031': 17,
 'tt0308055': 17,
 'tt0373883': 17,
 'tt4769836': 17,
 'tt0107290': 17,
 'tt0465234': 17,
 'tt0361748': 17,
 'tt3560148': 17,
 'tt0132347': 17,
 'tt2316411': 17,
 'tt1435513': 17,
 'tt2334879': 17,
 'tt1552224': 17,
 'tt0379725': 17,
 'tt1213641': 17,
 'tt0399201': 17,
 'tt1053424': 17,
 'tt0369339': 17,
 'tt4651520': 17,
 'tt1542344': 17,
 'tt0265086': 17,
 'tt0294870': 17,
 'tt0401711': 17,
 'tt1403177': 17,
 'tt0168629': 17,
 'tt0425061': 17,
 'tt1655441': 17,
 'tt1172233': 17,
 'tt1981677': 17,
 'tt1598642': 17,
 'tt4254242': 17,
 'tt0360717': 17,
 'tt0181875': 17,
 'tt1536537': 16,
 'tt0360486': 16,
 'tt0078788': 16,
 'tt0112004': 16,
 'tt1560747': 16,
 'tt0172156': 16,
 'tt2322641': 16,
 'tt0970416': 16,
 'tt4801232': 16,
 'tt1034032': 16,
 'tt0852713': 16,
 'tt0250494': 16,
 'tt0157246': 16,
 'tt1764234': 16,
 'tt4287320': 16,
 'tt3491962': 16,
 'tt0313911': 16,
 'tt0475900': 16,
 'tt1911644': 16,
 'tt1343727': 16,
 'tt3468798': 16,
 'tt4370596': 16,
 'tt0144084': 16,
 'tt0810922': 16,
 'tt0372183': 16,
 'tt0422401': 16,
 'tt1615160': 16,
 'tt4217392': 16,
 'tt0295701': 16,
 'tt0452623': 16,
 'tt1591479': 16,
 'tt0477348': 16,
 'tt0408839': 16,
 'tt0388574': 16,
 'tt4701182': 16,
 'tt2948160': 16,
 'tt0416044': 16,
 'tt0402022': 16,
 'tt0499556': 16,
 'tt4168956': 16,
 'tt6470478': 16,
 'tt1815862': 16,
 'tt4786824': 16,
 'tt5649144': 16,
 'tt0264395': 16,
 'tt0268978': 16,
 'tt3397884': 16,
 'tt0490086': 16,
 'tt3885690': 16,
 'tt0803096': 16,
 'tt2713180': 16,
 'tt3741700': 16,
 'tt4781612': 16,
 'tt4145054': 16,
 'tt1210166': 16,
 'tt0367882': 16,
 'tt0390022': 16,
 'tt1699748': 16,
 'tt0434409': 16,
 'tt2397255': 16,
 'tt0815236': 16,
 'tt0480255': 16,
 'tt3230454': 16,
 'tt2198243': 16,
 'tt0119654': 16,
 'tt0945513': 16,
 'tt1637725': 16,
 'tt3778644': 16,
 'tt1596363': 16,
 'tt2278388': 16,
 'tt0851851': 16,
 'tt0472399': 16,
 'tt5011816': 16,
 'tt5884052': 16,
 'tt4903242': 16,
 'tt1519931': 16,
 'tt1974419': 16,
 'tt0118571': 16,
 'tt3263904': 16,
 'tt7587890': 16,
 'tt2280066': 16,
 'tt0119822': 16,
 'tt1737796': 16,
 'tt0440963': 16,
 'tt0381707': 16,
 'tt6634854': 16,
 'tt0118421': 16,
 'tt0350258': 16,
 'tt1895315': 16,
 'tt0800325': 16,
 'tt0266465': 16,
 'tt0118884': 16,
 'tt2140379': 16,
 'tt3758172': 16,
 'tt5813366': 16,
 'tt1790864': 16,
 'tt0343737': 16,
 'tt0483607': 16,
 'tt0810819': 16,
 'tt3228420': 16,
 'tt2375692': 16,
 'tt0366551': 16,
 'tt1176740': 16,
 'tt0862467': 16,
 'tt1523267': 16,
 ...}

Now we know which tt numbers have multiple entiries, lets inspect a couple

In [134]:
name['known_for_titles']

0         tt0837562
1         tt2398241
2         tt0844471
3         tt0118553
4         tt3501180
            ...
477084    tt8697454
477085    tt0306913
477086    tt8726188
477087    tt8728296
477088    tt8706386
Name: known_for_titles, Length: 477089, dtype: object

## Combining the DataFrames

In [ ]:
basics.info()

In [ ]:
name.info()

In [ ]:
#the merge method is much more versatile than the join method so im using it for all the merges
#I chose a left join and started with basics here since its the smaller of the two frames
#a left join will use keys from the left table to match to the right and keep those records even if 
#theres no data on the right table.

basics.merge(name,how='left', left_on='tconst', right_on='known_for_titles')